app/Helpers/function_helper.php

    function count_items()
    {
        // Inisialisasi model
        $itemModel = new ItemModel();

        // Hitung jumlah item
        $count = $itemModel->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `items`

    function count_users()
    {
        // Inisialisasi model
        $userModel = new UserModel();

        // Hitung jumlah item
        $count = $userModel->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `users`

    function count_suppliers()
    {
        // Inisialisasi model
        $supplierModel = new SupplierModel();

        // Hitung jumlah item
        $count = $supplierModel->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `Suppliers`

    function count_customers()
    {
        // Inisialisasi model
        $customerModel = new CustomerModel();

        // Hitung jumlah item
        $count = $customerModel->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `customers`