app/Controllers/Auth.php

    public function index()
    {
        $ModelUser = new UserModel();
        $login = $this->request->getPost('login');
        if ($login){
            $username = $this->request->getPost('username');
            $password = $this->request->getPost('password');

            if ($username == '' || $password == '') {
                $err = "Silahkan masukkan username dan password";
            }

            if (empty($err)) {
                $user = $ModelUser->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1