app/Models/CategoryModel.php

SELECT *
FROM `categories`
---
    public function getCategories()
    {
        return $this->findAll();