app/Models/CustomerModel.php

    public function getCustomers()
    {
        return $this->findAll();
---
SELECT *
FROM `customers`