app/Models/ItemModel.php

    public function getItems()
    {
        return $this->select('items.*, categories.name as category_name, units.name as unit_name')
            ->join('categories', 'categories.category_id = items.category_id')
            ->join('units', 'units.unit_id = items.unit_id')
            ->findAll();
---
SELECT `items`.*, `categories`.`name` as `category_name`, `units`.`name` as `unit_name`
FROM `items`
JOIN `categories` ON `categories`.`category_id` = `items`.`category_id`
JOIN `units` ON `units`.`unit_id` = `items`.`unit_id`