app/Models/StockModel.php

SELECT `stocks`.*, `items`.`name` as `item_name`, `suppliers`.`name` as `supplier_name`, `items`.`barcode` as `barcode`, `users`.`name` as `user_name`
FROM `stocks`
JOIN `items` ON `items`.`item_id` = `stocks`.`item_id`
LEFT JOIN `suppliers` ON `suppliers`.`supplier_id` = `stocks`.`supplier_id`
JOIN `users` ON `users`.`user_id` = `stocks`.`user_id`
WHERE `stocks`.`type` = 'In'
ORDER BY `stock_id` DESC
---
    public function getStocksIn()
    {
        return $this->select('stocks.*, items.name as item_name, suppliers.name as supplier_name, items.barcode as barcode, users.name as user_name')
            ->join('items', 'items.item_id = stocks.item_id')
            ->join('suppliers', 'suppliers.supplier_id = stocks.supplier_id', 'left')
            ->join('users', 'users.user_id = stocks.user_id')
            ->where('stocks.type', 'In') // Add this line to filter by "In" type
            ->orderBy('stock_id', 'DESC')
            ->findAll();

SELECT `stocks`.*, `items`.`name` as `item_name`, `suppliers`.`name` as `supplier_name`, `items`.`barcode` as `barcode`, `users`.`name` as `user_name`
FROM `stocks`
JOIN `items` ON `items`.`item_id` = `stocks`.`item_id`
LEFT JOIN `suppliers` ON `suppliers`.`supplier_id` = `stocks`.`supplier_id`
JOIN `users` ON `users`.`user_id` = `stocks`.`user_id`
WHERE `stocks`.`type` = 'Out'
ORDER BY `stock_id` DESC
---
    public function getStocksOut()
    {
        return $this->select('stocks.*, items.name as item_name, suppliers.name as supplier_name, items.barcode as barcode, users.name as user_name')
            ->join('items', 'items.item_id = stocks.item_id')
            ->join('suppliers', 'suppliers.supplier_id = stocks.supplier_id', 'left')
            ->join('users', 'users.user_id = stocks.user_id')
            ->where('stocks.type', 'Out') // Add this line to filter by "In" type
            ->orderBy('stock_id', 'DESC')
            ->findAll();