app/Models/SupplierModel.php

SELECT *
FROM `Suppliers`
---
    public function getSuppliers()
    {
        return $this->findAll();