app/Models/transactionModel.php

    public function insertTransaction($data)
    {
        $this->insert($data);  // Insert transaction data
---
INSERT INTO `transactions` (`customer_id`, `transaction_date`, `sub_total`, `discount`, `grand_total`, `payment_method`, `status`) VALUES ('', '2024-10-30 13:14:18', '43000', '0', '43000', 'Cash', 'Paid')