app/Models/UnitModel.php

SELECT *
FROM `units`
---
    public function getUnits()
    {
        return $this->findAll();